firstroutes/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"
---
    def index
        if params[:user_id]
            user = User.find(params[:user_id])
            @artworks = user.shared_artworks + user.artworks
        else
            @artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "DamoisellesDavignon"], ["image_url", "www.dmd.com"], ["artist_id", 8]]
---
    def create
        # user = User.new(params.require(:user).permit(:name, :email))
        @artwork = Artwork.new(artwork_params)

        if @artwork.save!

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "favorited" = $1 WHERE "artworks"."id" = $2  [["favorited", true], ["id", 1]]
---
    def update
        @artwork = Artwork.find(params[:id])

        if @artwork.update(artwork_params)