firstroutes/app/controllers/artworkshares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 5], ["viewer_id", 9]]
---
    def create
        @artwork_share = ArtworkShares.new(artwork_share_params)

        if @artwork_share.save!

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]
---
    def destroy
        @artwork_share = ArtworkShares.find(params[:id])
        @artwork_share.destroy