firstroutes/app/controllers/comments_controller.rb

    def index
        if params[:artwork_id]
            art = Artwork.find(params[:artwork_id])
            @comments = art.comments

        elsif params[:user_id]
            user = User.find(params[:user_id])
            @comments = user.comments
        else
            @comments = Comment.all
        end

        if @comments.length == 0
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"

    def create
        @comment = Comment.new(comment_params)

        if @comment.save!
---
INSERT INTO "comments" ("text", "commenter_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Great"], ["commenter_id", 11], ["artwork_id", 5], ["created_at", "2020-04-23 18:07:50.194858"], ["updated_at", "2020-04-23 18:07:50.194858"]]