firstroutes/app/controllers/likes_controller.rb

    def index
        if params[:comment_id]
            comment = Comment.find(params[:comment_id])
            @likes = comment.likes
        elsif params[:artwork_id]
            artwork = Artwork.find(params[:artwork_id])
            @likes = artwork.likes
        elsif params[:user_id]
            user = User.find(params[:user_id])
            @likes = user.likes
        else
            @likes = Like.all
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 2]]