firstroutes/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%Van%')
SELECT "users".* FROM "users"
---
    def index
        if params[:username]
            @users = User.where("username LIKE :query", query: "%#{params[:username]}%")
        else
            @users = User.all

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "John"], ["email", "johnisbest"]]
---
    def create
        # user = User.new(params.require(:user).permit(:name, :email))
        @user = User.new(user_params)

        if @user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "Kyle"], ["email", "Monster"], ["id", 3]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params)